In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame({"group":["A","B","C","A","B","C"],
                    "data":[12,13,14,15,16,17]})
df1

  group  data
0     A    12
1     B    13
2     C    14
3     A    15
4     B    16
5     C    17

In [6]:
df1.groupby("group") # şu anda burad elimizdeki ver, setini belirli bir değişkene göre grupladık. ama bu kadar daha bir işlem yapmadı 
#sadece gupladı ve tutuypr elinde

In [13]:
df1.groupby("group").mean()

       data
group
A      13.5
B      14.5
C      15.5

In [10]:
df1.groupby("group").max() #gruplmasaydık

       data
group
A        15
B        16
C        17

In [11]:
df1.max()

group     C
data     17
dtype: object

In [14]:
df1.describe()

            data
count   6.000000
mean   14.500000
std     1.870829
min    12.000000
25%    13.250000
50%    14.500000
75%    15.750000
max    17.000000

In [15]:
df1.groupby("group").describe()

       data
      count  mean      std   min    25%   50%    75%   max
group
A       2.0  13.5  2.12132  12.0  12.75  13.5  14.25  15.0
B       2.0  14.5  2.12132  13.0  13.75  14.5  15.25  16.0
C       2.0  15.5  2.12132  14.0  14.75  15.5  16.25  17.0